load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 50
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 100
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 500
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 100
scenarios:
  - flow:
      - get:
          url: '/?key=sampleKey'
      - post:
          url: '/'
          json:
            key: 'sampleKey'
            value: { sample: 'value' }